# 1. Каждое из слов «разработка», «сокет», «декоратор» представить в строковом формате и проверить тип и содержание 
# соответствующих переменных. Затем с помощью онлайн-конвертера преобразовать строковые представление в формат 
# Unicode и также проверить тип и содержимое переменных.

a = 'разработка'
b = 'сокет'
c = 'декоратор'

print(a, type(a))
print(b, type(b))
print(c, type(c))

d = '\u0440\u0430\u0437\u0440\u0430\u0431\u043e\u0442\u043a\u0430'
e = '\u0441\u043e\u043a\u0435\u0442'
f = '\u0434\u0435\u043a\u043e\u0440\u0430\u0442\u043e\u0440'

print(d, type(d))
print(e, type(e))
print(f, type(f))
